NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l10/nrf54l10_application.svd
        <register>
          <name>REFSEL</name>
          <description>Reference select</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>REFSEL</name>
              <description>Reference select</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ref1_8Vdd</name>
                  <description>VDD * 1/8 selected as reference</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref2_8Vdd</name>
                  <description>VDD * 2/8 selected as reference</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref3_8Vdd</name>
                  <description>VDD * 3/8 selected as reference</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref4_8Vdd</name>
                  <description>VDD * 4/8 selected as reference</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref5_8Vdd</name>
                  <description>VDD * 5/8 selected as reference</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref6_8Vdd</name>
                  <description>VDD * 6/8 selected as reference</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref7_8Vdd</name>
                  <description>VDD * 7/8 selected as reference</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARef</name>
                  <description>External analog reference selected</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref1_16Vdd</name>
                  <description>VDD * 1/16 selected as reference</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref3_16Vdd</name>
                  <description>VDD * 3/16 selected as reference</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref5_16Vdd</name>
                  <description>VDD * 5/16 selected as reference</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref7_16Vdd</name>
                  <description>VDD * 7/16 selected as reference</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref9_16Vdd</name>
                  <description>VDD * 9/16 selected as reference</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref11_16Vdd</name>
                  <description>VDD * 11/16 selected as reference</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref13_16Vdd</name>
                  <description>VDD * 13/16 selected as reference</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref15_16Vdd</name>
                  <description>VDD * 15/16 selected as reference</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTREFSEL</name>
          <description>External reference select</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PIN</name>
              <description>External analog reference pin select</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>PORT</name>
              <description>GPIO Port selection</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ANADETECT</name>
          <description>Analog detect configuration</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ANADETECT</name>
              <description>Analog detect configuration</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Cross</name>
                  <description>Generate ANADETECT on crossing, both upward crossing and downward crossing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Up</name>
                  <description>Generate ANADETECT on upward crossing only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Down</name>
                  <description>Generate ANADETECT on downward crossing only</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HYST</name>
          <description>Comparator hysteresis enable</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HYST</name>
              <description>Comparator hysteresis enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Comparator hysteresis disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Comparator hysteresis enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
